autodesk.platform.core.string.IString.#ctor
Default Constructor
\throw       None

autodesk.platform.core.string.IString.detach
Release the connection to the held string data.
\throw       None

autodesk.platform.core.string.IString.isEmpty
Check to see if the currently held string is empty (NULL or L"").
\return	    true if the currently held string is empty.
\throw       None

autodesk.platform.core.string.IString.length
Returns the content length character count.
\note        The behavior of this function is the same as strlen or wcslen in the C Run-Time Library.
It is a naive implementation which makes no attempt at correct linguistic context.
For example, if the implementation stores data as UTF-8 encoded char*, this method
will simply return the number of chars in the string.
\return      The number of characters in the string.
\throw       None

autodesk.platform.core.string.IString.bytes
Returns the content length as byte count.
\return      The number of bytes in the string. Does not include the trailing NULL.
\throw       None

autodesk.platform.core.string.IString.set(autodesk.platform.core.string.IString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Set the content of this IString instance from the provided string.
If rString is the same type as this IString, then this instance will point to the
same counted string that rString points to and the ref count will be incremented.
If the types are different, then the string data will be converted.
\param       rString     The string from which to build.
\throw       any

autodesk.platform.core.string.IString.Dispose
Destructor
\throw       None

autodesk.platform.core.string.IString
\interface   IString    core/string/IString.h    "core/string/IString.h"
\brief       Base string interface.
\since       1.2